import { Badge } from "react-bootstrap"

const Concurrency = ()=>{
    return (<>
                        <h2>
                <Badge variant="success"> برنامه نویسی Functional</Badge>{' '}
</h2>

                    <p>
                    Clojure جهت اجتناب از وضعیت‌های قابل تغییر ابزارهایی را فراهم می‌کند، توابع را به عنوان ساختار‌های اولیه و اصلی زبان مهیا می‌کند و بر تکرارهای بازگشتی نسبت به به تغییرات در وضعیت برنامه مبتنی در حلقه‌ها تاکید دارد. Clojure یک زبان فانکشنال ناخالص(impure) است، با اینحال بر این فلسفه استوار است که برنامه‌هایی که بیشتر فانکشنال هستند، در مقابل قدرت ترمیم پذیری بالاتری نسبت به خطا دارند.
                </p>
    </>);
}

export default Concurrency ;