import { Badge } from "react-bootstrap"

const Dynamic = () => {
    return (<>
          <h2>
                <Badge variant="success">توسعه داینامیک</Badge>{' '}
</h2>

                    <p>
                    Clojure محیط داینامیکی است که می‌توانید با آن تعامل کنید.
                     تقریبا تمامی ساختارهای زبان
                     قابل استفاده 
                     و تغییر و شخصی سازی هستند 
                    و در نتیجه می توانند
                     براحتی مورد استفاده قرار گرفته و یا تغییر کنند.
                     می‌توانید برنامه خود
                     را با داده‌های لود شده، 
                    افزودن ویژگیها،
                     رفع باگ‌ها، 
                    آزمون کردن بصورت در یک فرآیند توسعه یکپارچه گسترش دهید.
                    </p>
    </>);
}

export default Dynamic;