import { Badge } from "react-bootstrap"

const RuntimePolymorphism = () => {
    return (<>
        <h2>
            <Badge variant="success">
                چندریختی زمان اجرا
                </Badge>{' '}
        </h2>

        <p>تغییر و گسترش سیستم‌هایی که از خاصیت چند ریختی زمان 
        اجرا استفاده می‌کنند آسان‌تر می‌باشد.
         Clojure مکانیزم‌های ساده، قدرتمند و منعطفی برای چندریختی زمان اجرا ارائه می‌دهد. 
         پروتوکل‌ها و انواع داده‌ی 
         Clojure مکانیزهایی جهت انتزاع و 
         تعریف ساختار داده  
         بدون هیچ‌گونه تعارض
          در مقایسه با امکاناتی
          که پلت‌فرم میزبان(غالبا JVM) 
          در اختیار قرار می‌دهد.             </p>
    </>)
}

export default RuntimePolymorphism;