import Layout from "../components/Layout";
import Footer from "../components/Footer";


import { Container } from "react-bootstrap"

const Statute = () => {
  return (
    <div>
      <Layout />
      
      <Container >
        <div className="rtl entry-content">
          <h2 className="statute-header">
            اساسنامه انجمن Clojure ایران
        </h2>
          <hr />
          <h3>
            سخن نخست: 
            
        </h3>
        
          <p>
            
            ما اعضای انجمن
             Clojure
              ایران، معتقد هستیم که زبان برنامه‌نویسی Clojure که ریشه در تاریخ برنامه‌نویسی دارد و به یکی از ابتدایی ترین زبان‌های برنامه‌نویسی سطح بالا،
                           یعنی LISP بر می‌گردد و شامل یکی از متفاوت‌ترین و البته 
                           شیرین‌ترین نحو نوشتاری می‌باشد
                           (دنیایی از پرانتز :) )، بدلیل ویژگی‌های ممتازی دارد به یکی از ساده‌ترین، قدرتمندترین و البته اقتصادی‌ترین زبان‌های برنامه نویسی چند منظوره تبدیل شده است. در این میان اما فقدان منابع آموزشی مناسب و همچنین نحو متفاوت‌تری که نسبت به سایر زبان‌های برنامه نویسی معمول دارد منجر به این شده است که بسیاری از سازمان‌ها و شرکت‌ها استفاده از آن را  برای خود پر خطر ببینند. همین موضوع هدفی شد برای ما که در تاریخ 23-04-1399  انجمن Clojure ایران را جهت معرفی و گسترش هرچه بیشتر و بهتر این زبان برنامه‌نویسی پرکاربرد تاسیس نمائیم.

</p>
          <h3>
            شعار انجمن:
        </h3>
          <p>
            We Are Clojurist</p>

          <h3>
            موسسین:
        </h3>
          <p>
            مسعود بهرامی
</p>
          <h3>
            اهداف:
        </h3>
          <p>
            انجمن Clojure ایران، با هدف معرفی و گسترش زبان برنامه نویسی Clojure به جامعه برنامه نویسی کشور تاسیس و راه‌اندازی شده است. در این راستا تلاش خواهیم کرد با ارائه مقالات تخصصی و آموزشی، وبینارها و گردهم‌آیی‌ها و کنفرانس‌های دوره‌ای ضمن فراهم آوردن بستری جهت تعامل افراد علاقمند به زبان برنامه‌نویسی Clojure به این مهم دست پیدا کنیم.
</p>
          <p>
            انجمن Clojure ایران، انجمنی غیرانتفاعی است
             که وابستگی به هیچ نهاد، جمعیت، دسته یا سازمان
             اجتماعی، سیاسی، قومی و مذهبی ندارد.
             ما اعضای انجمن فارغ از هر گونه مسائل مرتبط با 
             جنسیت و ویژگی‌های جسمی تعهد می‌نماییم که صرفا 
             در زمینه‌ها و در جهت علمی با یکدیگر همکاری کنیم.
</p>
          <h3>
            وظایف و فعالیت‌ها:
            </h3>
          <p>
            <ul>
              <li>
                بسترسازی برای گسترش ارتباطات علمی و تبادل تجربه بین متخصصانی که به موضوعات مرتبط با Clojure علاقه‌مند هستند.
              </li>
              <li>
                تشکيل گردهمائی‌های علمی در سطح کشور و منطقه
              </li>
              <li>
                ارایه خدمات آموزش و مشاوره به اشخاص و سازمان‌ها
              </li>
              <li>
                برقراری ارتباط و همکاری مشترک با انجمن‌های Clojure در سایر کشورها
              </li>
            </ul>

          </p>
        </div>
        
      </Container>
      <Footer />
    </div>
  )
}

export default Statute;